3dparty/ladon-repo/tests/data/stringtests/in_out_test.soap

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:WSDL="http://schemas.xmlsoap.org/wsdl/" xmlns:ns1="urn:ShopService" xmlns:tns="urn:ShopService" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" ><SOAP-ENV:Body><mns:in_out_method xmlns:mns="urn:StringTestService" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><in_string xsi:type="xsd:string">äöüÄÖÄ</in_string></mns:in_out_method></SOAP-ENV:Body></SOAP-ENV:Envelope>
